'''
Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
Затем пользователь вводит сами элементы множеств.
11 6
2 4 6 8 10 12 10 8 6 4 2
3 6 9 12 15 18
6 12
'''
# array_length_1 = int (input('Какой длинны будет 1 массив?: ')) 
# print("Введите элементы 1 массива:")
# list_1 = [int(input()) for _ in range(array_length_1)] # я привожу в список для того чтобы сохранить поряток при выводе
# print("получается вот такой массив:")
# print(*list_1)  
# print()  
# array_length_2 = int (input('Какой длинны будет 2 массив?: '))
# print("Введите элементы 2 массива:")
# list_2 = [int(input()) for _ in range(array_length_2)]
# print("получается вот такой массив:")
# print(*list_2)  

# many_1 = set (list_1)
# many_2 = set (list_2)
# many_union = set (many_1.intersection(many_2))

# print()
# print("Пересекаются:")
# print (*many_union)
