# Задача 26: Напишите программу, которая на вход принимает два числа A и B,
# и возводит число А в целую степень B с помощью рекурсии.
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8

# import exponentiation # !!! импартируем функцию из соседнего файла

# A = int(input("Ввидите число: "))
# B = int(input("В какую степень его возвести: "))
# print (exponentiation.exp(A, B)) 

# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
"""""
Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму 
двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1.
Также нельзя использовать циклы.
2 2
4
"""""
# import positive_sum # !!! импартируем функцию из соседнего файла

# a = int(input("Ввидите первое число: "))
# b = int(input("Ввидите второе число: "))

# print (positive_sum.posit_sum(a, b)) 

