# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1
# import random
# array_length = int (input('Какой длинны будет массив?: '))
# list_1 = [random.randint(1,9) for _ in range(array_length)]
# print("получается вот такой массив:")
# print(*list_1)    
# number = int (input('Какое число от 1 до 9 вы хотите найти?: '))
# if (number > 10) or (number < 1):
#   print("Ввели неверное число!")
# else:
#   counter = 0
#   for i in range(len(list_1)):
#     if number == list_1[i]:
#       counter += 1
#   print(f"Число {number} встречается в массиве {counter} раз")


# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
